IDEA StatiCa Open Model
PointSupportNode.SupportTypeX Property
Compatible with IDEA StatiCa Beta 21.0 - beta
 Support type in dirrection X
 Namespace: IdeaRS.OpenModel.Model
 Assembly: IdeaRS.OpenModel (in IdeaRS.OpenModel.dll) Version: 20.0.1.1 (20.0.1.1)
Syntax
public SupportTypeInDirrection SupportTypeX { get; set; }
Public Property SupportTypeX As SupportTypeInDirrection
	Get
	Set
public:
property SupportTypeInDirrection SupportTypeX {
	SupportTypeInDirrection get ();
	void set (SupportTypeInDirrection value);
}
Property Value
Type: SupportTypeInDirrection
See Also
Reference
PointSupportNode Class
IdeaRS.OpenModel.Model Namespace